Tekla.Structures.ModelInternal.RebarSplitter
The rebar splitter class.

Tekla.Structures.ModelInternal.RebarSplitter.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarSplitter class.

Tekla.Structures.ModelInternal.RebarSplitter.CloneStrip
Clones the splitter strip.
Returns: The cloned splitter strip.

Tekla.Structures.ModelInternal.RebarSplitter.CreateInstance
The create instance.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.RebarSplitter.ModifyInstance
The modify instance.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.RebarSplitter.SelectInstance
The select instance.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.RebarSplitter.ToStruct(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The to struct.
dotStrip: The dot strip.

Tekla.Structures.ModelInternal.RebarSplitter.FromStruct(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The from struct.
dotStrip: The dot strip.

Tekla.Structures.ModelInternal.RebarSplitter.LapLength
Gets or sets the lap length.

Tekla.Structures.ModelInternal.RebarSplitter.SplitTarget
Gets or sets the split target.

Tekla.Structures.ModelInternal.RebarSplitter.StaggerType
Gets or sets the stagger type.

Tekla.Structures.ModelInternal.RebarSplitter.StaggerOffset
Gets or sets the stagger offset.

Tekla.Structures.ModelInternal.RebarSplitter.LapSide
Gets or sets the lap side.

Tekla.Structures.ModelInternal.RebarSplitter.SplitOffset
Gets or sets the split offset.

Tekla.Structures.ModelInternal.RebarSplitter.LapOffsetDir
Gets or sets the lap offset dir.

Tekla.Structures.ModelInternal.RebarSplitter.LapOffsetType
Gets or sets the lap offset type.